latex_gantt.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-06-22 Wed 22:01 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>LaTeX - Gantt Chart</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="shaka" />
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content">
<h1 class="title">LaTeX - Gantt Chart</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">Introduction</a></li>
<li><a href="#orgheadline2">Installation</a></li>
<li><a href="#orgheadline3">Usage</a>
<ul>
<li><a href="#orgheadline4">Optional arguments</a></li>
<li><a href="#orgheadline5">Title</a></li>
<li><a href="#orgheadline12">Other commands</a>
<ul>
<li><a href="#orgheadline6"><code>\ganttbar</code></a></li>
<li><a href="#orgheadline7"><code>\ganttcon</code></a></li>
<li><a href="#orgheadline8"><code>\ganttbarcon</code></a></li>
<li><a href="#orgheadline9"><code>\ganttgroup</code></a></li>
<li><a href="#orgheadline10"><code>\ganttmilestone</code></a></li>
<li><a href="#orgheadline11"><code>\ganttmilestonecon</code></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline13">An example</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">Introduction</h2>
<div class="outline-text-2" id="text-orgheadline1">
<p>
Today, I found an interesting \(\LaTeX\) package, <i>gantt</i><sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>. This package is developped based on <i>pgf/tikz</i> and, as its name indicates, can produce <i>Gantt</i> charts.
</p>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2">Installation</h2>
<div class="outline-text-2" id="text-orgheadline2">
<p>
For <i>ArchLinux</i>, the package can be simply installed via <i>yaourt</i>.
</p>
<div class="org-src-container">

<pre class="src src-sh">yaourt texlive-gantt
</pre>
</div>
<p>
Alternatively, the corresponding <i>style</i> file can be downloaded from the <a href="http://www.martin-kumm.de/tex/gantt.sty">webpage</a>.
</p>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3">Usage</h2>
<div class="outline-text-2" id="text-orgheadline3">
<p>
The framework of using the package can be illustrated as
</p>
<div class="org-src-container">

<pre class="src src-latex">\usepackage{tikz}
\usepackage{gantt}
...

\begin{gantt}[key_1=value_1, key_2=value_2, ...]{number of task}{number of time slots}
\begin{ganttitle}
...
\end{ganttitle}
...
\end{gantt}
</pre>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4">Optional arguments</h3>
<div class="outline-text-3" id="text-orgheadline4">
<p>
<code>key_1, key_2, ...</code> are optional arguments, which can be
</p>
<dl class="org-dl">
<dt><code>xunitlength</code></dt><dd>length of one time slot (default: 1 cm)</dd>
<dt><code>fontsize</code></dt><dd>fontsize of labels (default: <code>\normalsize</code>)</dd>
<dt><code>titlefontsize</code></dt><dd>fontsize of title section (default: <code>\small</code>)</dd>
<dt><code>drawledgerline</code></dt><dd>switch to enable/disable the drawing of horizontal ledger lines (default: <code>false</code>)</dd>
</dl>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5">Title</h3>
<div class="outline-text-3" id="text-orgheadline5">
<p>
<code>ganttitle</code> is the environment for drawing the title section, which is comprised of a series of <code>\titleelement</code> and/or <code>\numtitle</code>
</p>
<div class="org-src-container">

<pre class="src src-latex">\numtitle{start number}{increment}{end number}{length of each title element}
...
\titleelement{label}{length}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12">Other commands</h3>
<div class="outline-text-3" id="text-orgheadline12">
</div><div id="outline-container-orgheadline6" class="outline-4">
<h4 id="orgheadline6"><code>\ganttbar</code></h4>
<div class="outline-text-4" id="text-orgheadline6">
<p>
Draws a single, unconnected bar for a task.
</p>
<div class="org-src-container">

<pre class="src src-latex">\ganttbar[pattern=&lt;pattern&gt;,color=&lt;color&gt;]{label}{start}{length}
</pre>
</div>
<p>
where
</p>
<ul class="org-ul">
<li><code>&lt;pattern&gt;</code> is a tikz pattern, e.g. north west lines (default), crosshatch, crosshatch dots, grid, etc.</li>
<li><code>&lt;color&gt;</code> is a tikz color of the pattern, e.g. black (default), red, green, blue, gray, dark gray.</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline7" class="outline-4">
<h4 id="orgheadline7"><code>\ganttcon</code></h4>
<div class="outline-text-4" id="text-orgheadline7">
<p>
Draw an arrow between two bars with specified coordinates.
</p>
<div class="org-src-container">

<pre class="src src-latex">\ganttcon{startx}{starty}{endx}{endy}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline8" class="outline-4">
<h4 id="orgheadline8"><code>\ganttbarcon</code></h4>
<div class="outline-text-4" id="text-orgheadline8">
<p>
Draw a single bar <b>and</b> connect it to the <b>previous</b> bar/milestone.
</p>
<div class="org-src-container">

<pre class="src src-latex">\ganttbarcon[pattern=&lt;pattern&gt;,color=&lt;color&gt;]{label}{start}{length}
</pre>
</div>
<p>
where the optional pattern argument are the same as <code>\ganttbar</code>.
</p>
</div>
</div>
<div id="outline-container-orgheadline9" class="outline-4">
<h4 id="orgheadline9"><code>\ganttgroup</code></h4>
<div class="outline-text-4" id="text-orgheadline9">
<p>
Draw a bar to group tasks.
</p>
<div class="org-src-container">

<pre class="src src-latex">\ganttgroup{label}{start}{length}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline10" class="outline-4">
<h4 id="orgheadline10"><code>\ganttmilestone</code></h4>
<div class="outline-text-4" id="text-orgheadline10">
<p>
Draw a milestone using a diamond.
</p>
<div class="org-src-container">

<pre class="src src-latex">\ganttmilestone[color=&lt;color&gt;]{label}{start}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline11" class="outline-4">
<h4 id="orgheadline11"><code>\ganttmilestonecon</code></h4>
<div class="outline-text-4" id="text-orgheadline11">
<p>
Draw a milestone using a diamond <b>and</b> connect it to the previous bar/milestone.
</p>
<div class="org-src-container">

<pre class="src src-latex">\ganttmilestonecon[color=&lt;color&gt;]{label}{start}
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline13" class="outline-2">
<h2 id="orgheadline13">An example</h2>
<div class="outline-text-2" id="text-orgheadline13">
<div class="org-src-container">

<pre class="src src-latex">\documentclass{article}

\usepackage{tikz}
\usepackage{gantt}

\begin{document}
 \begin{gantt}[xunitlength=0.3cm,fontsize=\small,titlefontsize=\small,drawledgerline=true]{10}{36}
    \begin{ganttitle}
      \titleelement{2012}{7}
      \numtitle{2013}{1}{2014}{12}
      \titleelement{2015}{5}
    \end{ganttitle}
    \begin{ganttitle}
      \numtitle{6}{1}{12}{1}
      \numtitle{1}{1}{12}{1}
      \numtitle{1}{1}{12}{1}
      \numtitle{1}{1}{5}{1}
    \end{ganttitle}
    \ganttbar{task 1}{2}{17}
    \ganttgroup{a group of tasks}{6}{18}
    \ganttbar{task 2}{5}{10}
    \ganttbar[pattern=crosshatch,color=blue]{task 3}{15}{3}
    \ganttbar{task 4}{20}{3}
    \ganttcon{15}{4}{20}{6}
    \ganttbar{task 5}{15}{5}
    \ganttbarcon[color=red]{task 6}{20}{5}
    \ganttbarcon{task 7}{30}{5}
  \end{gantt}
\end{document}
</pre>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="http://www.martin-kumm.de/wiki/doku.php?id=Projects:A_LaTeX_package_for_gantt_plots">http://www.martin-kumm.de/wiki/doku.php?id=Projects:A_LaTeX_package_for_gantt_plots</a>
</p></div></div>


</div>
</div></div>
</body>
</html>
